Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ལྟ ར་ དེ་བཞིན་ གཤེགས་པ་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ སྐུ་ ཀུན་ ཏུ་ སྟོན་པ་ ལ་སོགས་པ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དམིགས་པ་ མཐའ་ཡས་པ འི་ སངས་རྒྱས་ ཀྱི་ སྐུ་ ཀུན་ ཏུ་ སྟོན་པ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དང་ །_ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ པད་མ་ བཀོད་པ འི་ ཁྱུ་མཆོག་ དང་ །_ དྲ་བ་ ཅན་ གྱི་ འོད་ དང་ །_ འོད་ མཐའ་ ཡ ས་ སངས་རྒྱས་ མེ་ཏོག་ འབྱུང་ དང་ །_ རིན་ཆེན་ སཱ་ལ་ དང་ །_ རིན་ཆེན་ ཟླ་བ འི་ ཁྱུ་མཆོག་ དང་ །_ རྩི འི་ རྒྱལ་པོ་ དང་ །_ སྨན་ དང་ །_ ཡེ་ཤེས་ མཆོག་ དང་ །_ མངོན་དུ་ འཕགས་པ འི་ གོ་ཆ་ དང་ །_ ལྷུན་པོ་ གོང་ ན་ མེད་པ་ དང་ །_ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ དང་ །_ མེ་ཏོག་ བརྩེགས་ དང་ །_ མེ་ཏོག་ རབ་ གཏོར་ དང་ །_ རྟག་ ཏུ་ མཛེས་པ འི་ འོད་ཟེར་ དང་ །_ བླ་ ན་ |#| མེད་པ འི་ འོད་ཟེར་ དང་ །_ མི་ གཡོས་ རྣམ་པར་ གནོན་ དང་ །_ གོམ་པ ས་ རྣམ་པར་ གནོན་ དང་ །_ གོམ་པ་ མཐའ་ཡས་པ ས་ རྣམ་པར་ གནོན་ དང་ །_ སྨོན་ལམ་ མཐའ་ ཡ ས་ དང་ །_ སྤོབས་པ་ དཔག་མེད་ དང་ །_ ཁྱུ་མཆོག་ མཐའ་ ཡ ས་ དང་ །_ སྨོན་ལམ་ ངེས་པ་ དང་ །_ མངལ་ འགྱུར་ མཛད་ དང་ །_ སྐྱོན་མེད་ འགྱུར་ མཛད་ སྨོན་ལམ་ དང་ །_ དམིགས་པ འི་ གོ་ཆ་ དང་ །_ སངས་རྒྱས་ ནམ་མཁའ་ དང་ །_ འབྱུང་བ འི་ དཔལ་ གྱི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དང་ །_ དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ དང་ །_ གཞན་དག་ གི་ [109a] སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ནས་ |#| བྱང་ཆུབ་ སེམས་དཔའ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ ལྷགས་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ |#| ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ དོ །_།
en: $887 In this way arrived innumerably and unfathomably many bodhisattva great beings from the buddha realms of thus-gone ones such as Splendid Display of the Body of Buddhas Beyond Observation, Leader of the Lotus Array, Jālinīprabha , Source of Buddha Flowers of Limitless Light, Jewel Sal Tree , Precious Moon Leader, Nectar King, Medicine, Jñānottama , Superior Armor, Highest Mountain, Saha­cittotpāda­dharma­cakra­pravartin , Heap of Flowers, Spreader of Flowers, Light Rays of Constant Beauty, Unsurpassable Light Rays, Immovable Subjugator, Subjugating Steps, Subduer with Infinite Steps, Infinite Aspiration, Aprameya­prati­bhāna , Infinite Leader, Certain Aspiration, Changing the Womb, Aspiration Bringing Flawlessness, Armor of Observing, Buddha Sky , and Glorious Source. [109.a] Arriving here in the world of Enduring, they bowed their heads to the Blessed One’s feet and sat to one side.

source: དེ འི་ ཚེ་ ལྷོ་ནུབ་ ཀྱི་ ཕྱོགས་ མཚམས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བཀྲ་ཤིས་ བཟང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $888 At that time there was in the southwest, beyond innumerable and unfathomable universes, a universe known as Excellent Auspiciousness.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དོན་ཡོད་ གྲུབ་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Amoghasiddhi.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དོན་ ཐམས་ཅད་ གྲུབ་ ཅེས་བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Sarvartha­siddha would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ལྟ ར་ དེ་ ལ་སོགས་པ་ བཅོམ་ལྡན་ འདས་ དེ་བཞིན་ གཤེགས་པ་ གྲུབ་པ འི་ གོ་ཆ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དང་ །_ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ གཙུག་ཏོར་ཅན་ དང་ །_ ཤིན་ཏུ་ རབ་གནས་ གོ་ཆ་ དང་ །_ གོ་ཆ་ མཐའ་ ཡ ས་ དང་ །_ མཚན་ གྱི་ གོ་ཆ་ དང་ །_ གོ་ཆ་ མཐའ་ ཡ ས་ དང་ །_ ཀུན་ ནས་ གོ་ཆ་ དང་ །_ མར་མེ་མཛད་ དང་ །_ འོད་ མཛད་ དང་ །_ མཛོད་ གཅིག་པ་ དང་ །_ སྐུ་ མི་ མངའ་བ་ དང་ །_ དྲ་བ་ ཅན་ གྱི་ འོད་ཟེར་ དང་ །_ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ དང་ །_ རྩེ་མོ་ དང་ །_ རྩེ་མོ་ མངོན་དུ་ འཕགས་ དང་ །_ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ ཅན་ དང་ །_ རྣམ་པར་ གཟིགས་ དང་ །_ དོན་ཡོད་ མིང་ སྒྲོགས་ དང་ །_ འཇིགས་ པ་ དང་ །_ བག་ཚ་བ་ ཐམས་ཅད་ རྣམ་པར་ འཇོམས་ མཛད་ དང་ །_ ཡོན་ཏན་ མཐའ་ ཡ ས་ རྒྱལ་པོ འི་ འོད་ དང་ །_ ཕྱིར་རྒོལ་བ་ ཐམས་ཅད་ ངེས་པ ར་ འཇོམས་ དང་ །_ བདུད་ ཐམས་ཅད་ ཀྱི་ ཡུལ་ ལས་ འདས་པ་ དང་ །_ དཔག་མེད་ མེ་ཏོག་ དང་ །_ བདུད་རྩི་ འཛིན་ དང་ །_ དབྱངས་ ཀྱི་ ང་རོ་ དཔག་མེད་ དང་ །_ འོད་ཟེར་ བརྩེགས་ དང་ །_ སྣང་བ འི་ དཔལ་ དང་ །_ གཉིས་ མེད་ བྲལ་བ འི་ དཀྱིལ་འཁོར་ ཅན་ དང་ །_ འཆི་མེད་ རྟོགས་པ འི་ མེ་ཏོག་ འོད་ཟེར་ དང་ །_ བདུད་རྩི འི་ དབྱངས་ དང་ །_ ལྷུན་པོ འི་ འོད་ དང་ །_ ཤིན་ཏུ་ མཐོང་ དང་ །_ སྤྱན་ བཟངས་ དང་ །_ མཆོག་ གི་ ཚོགས་ [109b] ཅན་ དང་ །_ རིན་ཆེན་ མེ་ཏོག་ དང་ །_ རིན་ཆེན་ འབྱུང་ དང་ །_ ཟླ་བ འི་ མེ་ཏོག་ དང་ །_ སེམས་ཅན་ ཀུན་ གྱི་ གོ་ཆ་ དང་ །_ སྙིང་པོ་ ཐམས་ཅད་ འགྱུར་ མཛད་ དང་ །_ སྤོབས་པ་ མཐའ་ ཡ ས་ དང་ །_ རྩོད་པ་ དང་ །_ བག་ཚ་བ་ མི་ མངའ་བ་ དང་ །_ དམིགས་པ་ ཐམས་ཅད་ སྤོབས་པ ས་ སྤྱོད་པ་ དང་ །_ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ དེ་དག་ དང་ །_ གཞན་དག་ གིས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ནས་ |#| བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སྐྱེ་བ་ གཅིག་ གིས་ ཐོགས་པ་ དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ ལྷགས་ ནས་ བཅོམ་ ལྡན་འདས་ ཤཱཀྱ་ ཐུབ་པ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ |#| ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ དོ །_།
en: $889 In this way arrived innumerably and unfathomably many bodhisattva great beings, all held back by just a single birth, from the buddha realms of blessed thus-gone ones such as Armor of Accomplishment, Śikhin, Armor of Stable Presence, Infinite Armor, Armor of Marks, Infinite Armor,#34 Universal Armor, Dīpaṃkara, Prabhaṅkara, Single Treasury, Bodyless, Jālinīprabha , Anantavīrya, Summit, Superior Summit, Luminous Disk, Vipaśyin, Propagator of the Meaningful Name, Destroyer of All Fear and Anxiety, Light of the King of Infinite Qualities, Vanquisher of All Attacks, Sarvamāraviśayasamatkrānta, Fathomless Flower, Amṛtaṃdhara, Unfathomable Melodious Roar, Raśmikūṭa, Glorious Light, Possessor of the Free Sphere of Nonduality, Radiant Flower of the Realization of Immortality, Amṛtaghoṣa, Mountain of Light, Sudarśana, Sunetra , Supreme Accumulations, [109.b] Jewel Flower, Ratnākara, Moon Flower, Armor of All Beings, Transformer of All Essences, Boundless Acumen, Free from Dispute and Anxiety, and Courageous Engagement with All Objects of Perception. |#| Arriving in the world of Enduring, they proceeded to the place where the Blessed One was residing. |#| There they bowed their heads to the Blessed One’s feet and sat to one side.

source: དེ འི་ ཚེ་ ནུབ་བྱང་ གི་ ཕྱོགས་མཚམས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཙན་དན་ སྤོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $890 At that time there was in the northwest, beyond innumerable and unfathomable universes, a universe known as Sandalwood Incense.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་ པ་ ཀུན་ དུ་ སྤོས་ ཀྱི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Radiant Incense.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཀུན་ ཏུ་ བཟང་པོ་ ཞེས་ བྱ་བ་ རྒྱལ་ཚབ་ དུ་ དབང་ བསྐུར་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had consecrated a bodhisattva known as Samantabhadra to be his regent . . .

source: དེ་ལྟ ར་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཀུན་ དུ་ སྤོས་ ཀྱི་ འོད་ཟེར་ ལ་སོགས་པ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ སྤོས་ ཀྱི་ གླང་པོ་ཆེ་ དང་ །_ སྤོས་ ཀྱི་ ཁྱུ་མཆོག་ དང་ །_ སྤོས་ ཀྱི་ ཁང་པ་ དང་ །_ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ ཅན་ དང་ །_ འོད་ཟེར་ གྱི་ རྒྱལ་པོ་ དང་ །_ པད་མ་ མངོན་དུ་ འཕགས་པ འི་ རྒྱལ་པོ་ དང་ །_ སངས་རྒྱས་ ཁྱུ་མཆོག་ དང་ །_ ཁྱུ་མཆོག་ མཐའ་ ཡ ས་ དང་ །_ གོ་ཆ་ བཟང་པོ་ དང་ །_ ཤིན་ཏུ་ གོ་ཆ་ བགོས་པ འི་ དཔལ་ དང་ །_ མེ་ཏོག་ རབ་ གཏོར་ དང་ །_ མེ་ཏོག་ གདུགས་ ཀྱི་ ཕྲེང་བ་ དང་ །_ མེ་ཏོག་ ཁང་པ་ དང་ །_ གསེར་ གྱི་ མེ་ཏོག་ དང་ །_ སྤོས་ ཀྱི་ མེ་ཏོག་ དང་ །_ ལྷུན་པོ འི་ རྒྱལ་པོ་ དང་ །_ སེམས་ཅན་ ཀུན་ ལས་ མངོན་པར་ འཕགས་པ འི་ གོ་ཆ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ སྐྱོན་མེད་ འགྱུར་ མཛད་ དང་ །_ ལེགས་པ ར་ སྤྱད་པ འི་ གོ་ཆ་ དང་ །_ ཀུན་ ཏུ་ བཏང་བ འི་ འོད་ཟེར་ རབ་ བཏང་ དང་ །_ པད་མ་ རབ་ གཏོར་ འབྱུང་བ འི་ [110a] དཔལ་ དང་ །_ རིན་ཆེན་ དྲ་བ་ དང་ །_ མངོན་དུ་ འཕགས་པ འི་ རྒྱལ་པོ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཞིང་ གདུགས་ གཅིག་པ ས་ ཁྱབ་པ་ དང་ །_ རྒྱུ་སྐར་ གྱི་ རྒྱལ་པོ་ དང་ །_ དཔུང་མགོ་ ཤིན་ཏུ་ ཟླུམ་པ་ དང་ །_ ཤིན་ཏུ་ ཡང་དག་ ཞུགས་ ཀྱི་ རྒྱལ་པོ་ དང་ །_ སྤོས་ ལྡན་ དང་ །_ ཡེ་ཤེས་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ དང་ །_ དོན་ཡོད་ གོ་ཆ་ བགོས་ དང་ །_ མཐོང་བ་ དོན་ཡོད་ དང་ །_ ཐོགས་པ་ མེད་པ འི་ སྤྱན་ དང་ །_ སེམས་ དང་པོ་ བསྐྱེད་པ་ དང་ ལྡན་པ འི་ མི་ འཁྲུགས་པ་ དང་ །_ སྤྱན་ མཐའ་ ཡ ས་ དང་ །_ མར་མེ འི་ བདག་པོ་ དང་ །_ ཀུན་ དུ་ སྣང་བ་ དང་ །_ སྣང་བ འི་ འོད་ཟེར་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཞིང་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ གཅད་ དུ་ མེད་པ འི་ སྤོབས་པ་ དང་ །_ རྡུལ་མེད་ རྡུལ་བྲལ་ རྣམ་པར་ གནོན་ དང་ །_ གོམ་པ་ མེད་ ཀྱིས་ རྣམ་པར་ གནོན་ དང་ །_ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ དེ་དག་ ལ་སོགས་པ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དག་ ནས་
en: $891 In this way arrived innumerably and unfathomably many bodhisattva great beings, all held back by just a single birth, from the buddha realms of blessed thus-gone ones such as Radiant Incense, Gandhahastī, Incense Leader, Incense Mansion, Jālinīprabha, King of Light Rays , King of Superior Lotuses, Buddha Leader, Infinite Leader, Excellent Armor, Splendid Armor Bearer, Spreader of Flowers, Flower Parasol Garland, Flower Mansion, Golden Flower, Incense Flower, King of Mountains , Armor That Excels among All Sentient Beings, Rendering All Beings Flawless, Armor of Excellent Action, Constant Spreader of Light Rays, Glorious Source of the Spreading of Lotus Flowers, [110.a] Ratnajāla, Superior King, Pervading All Buddha Realms with a Single Parasol, Tārarāja, Susaṃ­vṛttas­kandha, Susaṃ­prasthita­rāja, Gandhavati , Leader of Infinite Wisdom, Bearer of the Meaningful Armor, Amoghadarśin , Unhindered Eyes, Immutable One Endowed with the Original Generation of the Mind, Infinite Eyes, Lord of Lamps, Samantāloka , Jyotiraśmi, Acumen That Does Not Leave Out Any Being throughout All Buddhafields, Stainless and Pure Subjugator, and Subduer with Infinite Steps.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་ པོ་ སྐྱེ་བ་ གཅིག་ གིས་ ཐོགས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་
en: Arriving in the world of Enduring, they proceeded to the place where the Blessed One was residing, bowed their heads to his feet, and sat to one side.

source: དེ འི་ ཚེ་ བྱང་ཤར་ གྱི་ ཕྱོགས་མཚམས་ སུ་ འཇིག་ རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མངོན་དུ་ བགྲོད་བྱ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $892 At that time there was in the northeast, beyond innumerable and unfathomable universes, a universe known as Progression.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ མྱ་ངན་ ཐམས་ཅད་ སེལ་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་ |#| འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: There resided the thus-gone one, the worthy one, the perfect buddha Dispeller of All Suffering. |#| Abiding and remaining present there, he taught the Dharma.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དོན་ཡོད་ མིང་ སྒྲོལ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Propagator of the Meaningful Name would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ཡང་ བཅོམ་ལྡན་འདས་ ཤཱཀྱ་ ཐུབ་པ་ ལ་ ཆོས་ མཉན་པ འི་ ཕྱིར་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ལྟ་ ལགས་སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: . . . |#| “Yes, indeed,” answered the bodhisattva.

source: དེ་ལྟ ར་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ མྱ་ངན་ ཐམས་ཅད་ སེལ་ མཛད་ ལ་སོགས་པ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མངོན་དུ་ བགྲོད་བྱ་ དེ འི་ ཡང་ ཕ་རོལ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མྱ་ངན་མེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $893 Situated beyond the universe Progression of the blessed thus-gone Dispeller of All Suffering, and other such realms, there was a universe known as Aśoka .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མྱ་ངན་ བྲལ་ ཞེས་ བྱ་བ་ [110b] བཞུགས་ ཏེ་
en: There resided the thus-gone Vigataśoka. [110.b]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འོད་ ཆེན་པོ་ ཞེས་ བྱ་བ་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཆོས་ ཀྱི་ སྐྱེས་ བཀུར་ ཏེ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Great Light , with a Dharma gift.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལག་པ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Infinite Hands.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ འབྱུང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $895 Situated beyond that universe was a universe known as Guṇākara .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཕྱད་པ འི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Constant Intelligence.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གསེར་ གྱི་ དྲ་བ ས་ ཀུན་ དུ་ ཁེབས་ པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $896 Situated beyond that universe was a universe known as Draped with Golden Nets.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སེང་གེ འི་ ལྷུན་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Lion Mountain.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ ཀྱི་ འོད་ ཅེས་ བྱ་བ་ ཡོད་ དེ །_
en: $897 Situated beyond that universe was a universe known as Gandhaprabhāsa.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤོས་ ཀྱིས་ རྒྱགས་པ ར་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Instiller of Confidence.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དབྱངས་ ཀྱིས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ghoṣadatta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ བརྩེགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $898 Situated beyond that universe was a universe known as Ratnakūṭa .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཀཽཎྜི་ ནྱ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Kaunḍinya.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མཚན་ཉིད་ གཉིས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Glory of the Two Marks.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བརྟན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $899 Situated beyond that universe was a universe known as Dṛḍha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཐུ་དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Power.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཚངས་པ ས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Brahmādatta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཨུད་པ་ [111a] ལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $900 Situated beyond that universe was a universe known as Utpala. [111.a]

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཨུད་པ་ ལ་ དམར་པོ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of the Red Utpala.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ པད་མ་ འབྱུང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Padmākara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ ཀུ་མུ་ད་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $901 Situated beyond that universe was a universe known as Kumuda .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཀུ་མུ་ད་ འབྱུང་བ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of Kumudas.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འཇིགས་པ་ མེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Abhaya.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རབ་ སྒྲོགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $902 Situated beyond that universe was a universe known as Nirghoṣa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ གོང་ ན་ མེད་པ འི་ གཟི་བརྗིད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Unsurpassable Splendor.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ སྤོས་ བཀོད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $903 Situated beyond that universe was a universe known as Incense Array.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བརྟུལ་ཞུགས་ བཟང་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Suvrata.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣང་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $904 Situated beyond that universe was a universe known as Illumination .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དཔལ་ གྱི་ སྙིང་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Śrīgarbha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ་ འཕགས་པ འི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Noble Moonlight.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཕྱོགས་ ཀྱི་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Universal Lamp.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཕྱོགས་ སུ་ རྣམ་པར་ བསྒྲགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Universally Renowned.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྣམ་པར་ བསྒྲགས་པ འི་ སྟོབས་ ཀྱི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཏང་ [111b] ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva King of Renowned Power. [111.b]

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྐར་མ འི་ རྒྱལ་པོ་ ཚོགས་ ཀྱི་ བདག་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Star King Mastering the Gatherings.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ དུ་ སྣང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $908 Situated beyond that universe was a universe known as Samantāva­bhāsa­ketu.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྣང་བ་ མཐའ་ ཡ ས་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Śrī Amitābha.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དྲི་མ་ མེད་པ འི་ ཏོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Stainless Crest.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ སྣང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $909 Situated beyond that universe was a universe known as Incense Light .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤོས་ མེད་ མཆོག་ གི་ ལྷུན་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supreme Mountain Without Pride.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྣམ་པར་ རྒྱལ་བ་ སྲུང་བ་ ཅན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Victorious and Protected.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་ འཇིགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $910 Situated beyond that universe was a universe known as Abhaya .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྐྱེ་བོ འི་ དབང་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Janendra.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདེ་འབྱུང་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Śrīsukhākara.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡིད་གཉིས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Viśeṣamati.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣང་བ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $912 Situated beyond that universe was a universe known as Amitābha .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ སྤྱོད་པ་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Source of Activity with Infinite Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འགྲོ་བ འི་ དབང་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Lokendra.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བརྒྱན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $913 Situated beyond that universe was a universe known as Adorned .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ ཀུན་ གྱིས་ སོ་སོ ར་ བརྒྱན་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Adorned with All Qualities.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ [112a] སྟོན་ ཏེ །_
en: Abiding and remaining present there, he taught the Dharma. [112.a]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དགའ་སྤྱོད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Partaking of Bliss.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ འི་ དྲ་བ ས་ ཀུན་ དུ་ ཁེབས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $914 Situated beyond that universe was a universe known as Draped with Lotus Nets.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Flower King.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མེ་ཏོག་ འབྱུང་བ་ མངོན་དུ་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Splendor of the Noble Source of Flowers.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྒྱལ་མཚན་ སྣ་ཚོགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $915 Situated beyond that universe was a universe known as Vicitradhvajā.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དབང་ སྦས་ འོད་ཟེར་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Light Rays of Hidden Mastery.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཀུན་ ནས་ སྦས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Utterly Hidden.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ་ འཇིགས་བྱེད་ མངོན་དུ་ འཕགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Noble King of the Terrifying Lotus.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ སྨན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Wisdom Medicine.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤྱོད་པ་ ཐ་དད་ མེད་ འབྱུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of Undivided Activities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤྱོད་པ་ ཐ་དད་ མེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Undivided Activities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ང་རོ་ བསྡམས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Chosen Roar.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ང་རོ་ འབར་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Blazing Roar.

source: དེ་ ན་ དེ་བཞིན་ [112b] གཤེགས་པ་ ནམ་མཁ འི་ དཀྱིལ་འཁོར་ རྣམ་པར་ དག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Perfectly Pure Sphere of Space.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལྷུན་པོ་ མཆོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Supreme Mountain.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མངོན་དགའ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $921 Situated beyond that universe was a universe known as Abhirati.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཚན་མ་ མེད་པ འི་ ང་རོ་ ངེས་པ འི་ དབྱངས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Melody of the Definite Roar Beyond Marks.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤྱན་རས་ གཟིགས་ ཀྱི་ ང་རོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Roar of the Seer.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ འབྱུང་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $922 Situated beyond that universe was a universe known as Source .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མངོན་དུ་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Superior Splendor.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཅི་ འཇིགས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Kimbhīra.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ ཚངས་ ལྡན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $923 Situated beyond that universe was a universe known as Endowed with Brahmā.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཚངས་པ ས་ མཆོད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Offered by Brahmā.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐོགས་པ་ མེད་པ འི་ སྤོས་ ཀྱི་ གླང་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Unhindered Antidote.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ འི་ འོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Mountain of Light.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ མར་མེ་ བྱེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $926 Situated beyond that universe was a universe known as Dīpaṃkara .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྒྲོན་མ་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Lamp Maker.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤྲིན་ གྱི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Light Rays of the Clouds.
